In [2]:
import pandas as pd
data={'Name':['parekh','panchal','shah','patel'],'Age':[19,20,19,25]}
index=['Rank1','Rank2','Rank3','Rank4']
df=pd.DataFrame(data,index)
df

          Name  Age
Rank1   parekh   19
Rank2  panchal   20
Rank3     shah   19
Rank4    patel   25

In [4]:
df['Course']=pd.Series(['Computer','IT','mechanical','Auto'],index)
df

          Name  Age      Course
Rank1   parekh   19    Computer
Rank2  panchal   20          IT
Rank3     shah   19  mechanical
Rank4    patel   25        Auto

In [5]:
df[2:5]

        Name  Age      Course
Rank3   shah   19  mechanical
Rank4  patel   25        Auto

In [7]:
df.loc['Rank2']

Name      panchal
Age            20
Course         IT
Name: Rank2, dtype: object

In [8]:
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])
df=df.append(df2)
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8